<?php
//$a = 5.0; //把4赋值给变量a
//$b = "abc"; //把字符串abc赋值给变量b

//$n1 = 5;
//$n2 = 6;
//echo $n1 + $n2;
//echo $n1 - $n2;
//echo $n1 * $n2;
//echo $n2 / $n1;
//echo $n2 % $n1;   //6/5 的余数  1  .... 1
//echo 10 % 4;   //4  .... 1
//echo 2**3; //8
//echo 2**4; //16
//echo pow(2,4);

//$a = 6;
//echo decbin($a);
//$b = 5;
//echo decbin($b);

//按位与
//echo decbin($a & $b);

/*1 & 1  =  1;
0 & 0  =  0;
1 & 0  =  0;*/

/*110
101
----------
100*/


/**
 * 十进制     二进制
 * 1          1
 * 2          10
 * 3          11
 * 4          100
 * 5          101
 * 6          110
 * 7          111
 */

//echo $a | $b;

/*110
101
-------
111*/

//echo $a ^ $b;

/*110
101
-------
011*/

//echo decbin($a);

// 110    6
//-----------
    //001
//echo ~$a;

/*$c = 4;
$d = 2;
//echo $c << $d;
echo $c >> $d;*/

/*$d = 11;
$e = "11";*/
/*if($d != $e) {  //  ! =
    echo "答对了";
}else {
    echo "错误";
}*/
/*if($d <> $e) {  //  ! =
    echo "答对了";
}else {
    echo "错误";
}*/
/*if($a<=4) {
    echo "成立";
}else{
    echo "不成立";
}*/


//$a = 6;
//$b = 5;
//echo $a<=>$b;
//$c = 2;
//echo $a??$b??$c;











