<?php
//逻辑运算符
//逻辑与   &&
//当A为真,B为真时, 结果为真
//当A为假,B为真时, 结果为假
//当A为真,B为假时, 结果为假
//当A为假,B为假时, 结果为假

$a = 3;
$b = 4;
/*if($a-$b<0 && $a+$b <6) {
    echo "真";
}else{
    echo "假";
}*/

//逻辑或   ||
//当A为真,B为真时, 结果为真
//当A为假,B为真时, 结果为真
//当A为真,B为假时, 结果为真
//当A为假,B为假时, 结果为假
///注意:逻辑或前面的条件如果成立，后面的条件将不会执行
/*if($a-$b < 0 || $a+$b > 16) {
    echo "真";
}else{
    echo "假";
}*/

//逻辑非
$a = 4;
$b = 3;
/*if(!($a - $b == 1)){
    echo "成立";
}else{
    echo "不成立";
}*/

//逻辑异或  xor
//当A为真,B为真时, 结果为假
//当A为假,B为真时, 结果为真
//当A为真,B为假时, 结果为真
//当A为假,B为假时, 结果为假
/*$a = 4;
$b = 3;
if($a >5 xor $b >3) {
    echo "成立";
}else{
    echo "不成立";
}*/

/*$a = 3;
$a++;
//$a = $a + 1;
echo $a;*/

/*++$a;
echo $a;*/

$a = 10;

//echo $a;
//echo $a++;
//echo ++$a;
//$a++;
//++$a;
//echo $a;

//echo $a--;
//echo --$a;
/*$a = 100;
$a+=3;  //$a = $a + 3;


$a-=3;  //$a = $a-3;

$a*=3;  //$a = $a * 100;

$a/=3;  //$a = $a / 3;

$a %=3;  // $a = $a % 3;   // 33  ..... 1

echo $a;*/

/*$a = "您";
$b = "好";
echo $a.$b;*/

/*$a = "123";
$a.="456";
$a.="789";
echo $a;*/

if(@unlink("1.txt")){
    echo "删除成功";
}else{
    echo "删除失败";
}







